BPEL/PruebaCA/test/TestCase3/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pru="PruebaCA">
  <soapenv:Body>
    <pru:CallsSearchOperation>
      <customerID>2</customerID>
      <month>9</month>
      <year>2021</year>
    </pru:CallsSearchOperation>
  </soapenv:Body>
</soapenv:Envelope>